michaelnu/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
/*    External step generator and IO interface for LinuxCNC over Ethernet
 *    with dual-core ESP32 and built-in Ethernet RMIi PHY LAN8270 or SPI Ethernet W5500 modules
 *
 *    Copyright 2024 Wez Hunter <wez at hunter.to>
 *    Copyright 2022 Juhász Zoltán <juhasz.zoltan at freemail dot hu> (Original HAL2UDP project that this was based on but firmware no longer resembles much of it)
 *
 *    version:20240218
 *
 *    This program is free software; you can redistribute it and/or modify
 *    it under the terms of the GNU General Public License as published by
 *    the Free Software Foundation; either version 2 of the License, or
 *    (at your option) any later version.
 *
 *    This program is distributed in the hope that it will be useful,
 *    but WITHOUT ANY WARRANTY; without even the implied warranty of
 *    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *    GNU General Public License for more details.
 *
 *    You should have received a copy of the GNU General Public License
 *    along with this program; if not, write to the Free Software
 *    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

/*    Hardware: TODO document all hardware, pins and available mappings for each use-case
 *
 *    ESP32-WROOM or WROVER modules - Two Cores 240Mhz each.
 *    8 channel RMT peripheral so can drive 8 stepper motors with RMT peripheral hardware up-to 200khz total with native IO.
 *    The MCPWM or PCNT (Pulse Counter) hardware peripherals are NOT used therefore leaving them free for hardware pulse counting Servo Encoder tracking later
 *    https://github.com/gin66/FastAccelStepper/tree/master?tab=readme-ov-file#overview
 *    https://github.com/gin66/FastAccelStepper/tree/master?tab=readme-ov-file#esp32-2
 *
 *
 *    Software setup -
 *    Core 1 - Arduino loops, OTA Updates and Serial Stats Task (disable in config as needed - no impact measured if left enabled)
 *    Core 0 - Ethernet, UDP Client & Server, Motor commands, Servo Step Gen, Input handler Task, Telnet server
 *
 *    GPIO pins - see hardware docs for each board and map pins to your needs. All settings in Config.h.
 *    Motor STEP pins must be on native GPIO not on a I2C/I2S bus for RMT peripheral to work. Everything else is free reign.
 *
 */

/*==================================================================*/
/*==================================================================*/
#include <Arduino.h>
#include <ESP32Console.h>
#include "ESP32Console/Helpers/PWDHelpers.h"
#include "ArduinoNvs.h"
#include <WiFi.h>       // For connecting ESP32 to WiFi
#include <ArduinoOTA.h> // For enabling over-the-air updates via network either WiFi or Ethernet
#include <esp_timer.h>
#include "soc/rtc_wdt.h"
#include <esp_task_wdt.h>
#include "esp32-hal-log.h"

#include "Types.hpp"
#include "ConsoleMenus.h"
#include "Config.h"
#include "ConfigManager.h"
#include "ControllerMode.h"
#include "ClientMode.h"
#include "Pins.h"
#include "I2SOut.h"

#if ESP32_RMII_ETHERNET
#include <ETH.h> /* Espressif RMII Native Ethernet lib */
#elif ESP32_SPI_ETHERNET
#include <AsyncUDP_ESP32_Ethernet.h> /* W5500 SPI Native Ethernet lib */
#endif

/*==================================================================*/
xQueueHandle IRAM_ATTR inputInterruptQueue;
bool eth_connected = false;
bool wifi_connected = false;
uint8_t inputPinInterruptFired[MAX_INPUTS] = {0};

/*==================================================================*/
void WiFiEvent(WiFiEvent_t event)
{
    switch (event)
    {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        printf("WiFi IP: %s\r\n", WiFi.localIP().toString().c_str());
        break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
        printf_P(PSTR("WiFi Connected!\r\n"));
        wifi_connected = true;
        break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        telnetDisconnectAllClients();
        printf_P(PSTR("WiFi Lost Connection!\r\n"));
        wifi_connected = false;
        break;
    case ARDUINO_EVENT_WIFI_STA_STOP:
        telnetDisconnectAllClients();
        printf_P(PSTR("WiFi Station Stopped!\r\n"));
        wifi_connected = false;
        break;
    case ARDUINO_EVENT_WIFI_STA_START:
        printf_P(PSTR("WiFi Station Started\r\n"));
        break;
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
        printf_P(PSTR("WiFi Connected!\r\n"));
        wifi_connected = true;
        break;
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
        telnetDisconnectAllClients();
        printf_P(PSTR("WiFi Lost Connection!\r\n"));
        wifi_connected = false;
        break;
    case ARDUINO_EVENT_WIFI_AP_STOP:
        // printf_P(PSTR("WiFi AP Stopped!\r\n"));
        wifi_connected = false;
        break;
    case ARDUINO_EVENT_WIFI_AP_START:
        // printf_P(PSTR("WiFi AP Started\r\n"));
        break;
#if CONFIG_IDF_TARGET_ESP32S2
#else
    case ARDUINO_EVENT_ETH_START:
        printf_P(PSTR("Ethernet Started\r\n"));
        ETH.setHostname("esp32-linuxcnc");
        break;
    case ARDUINO_EVENT_ETH_CONNECTED:
        printf_P(PSTR("Ethernet Link UP\r\n"));
        eth_connected = true;
        break;
    case ARDUINO_EVENT_ETH_GOT_IP:
        printf("Ethernet MAC: %s, IPv4: %s, %s Duplex, Speed: %dMbps\r\n", ETH.macAddress().c_str(), ETH.localIP().toString().c_str(), (ETH.fullDuplex()) ? "Full" : "Half", ETH.linkSpeed());
        eth_connected = true;
        break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
        telnetDisconnectAllClients();
        printf_P(PSTR("Ethernet Link DOWN\r\n"));
        eth_connected = false;
        break;
    case ARDUINO_EVENT_ETH_STOP:
        printf_P(PSTR("Ethernet Stopped\r\n"));
        eth_connected = false;
        break;
#endif
    default:
        break;
    }
}

/*==================================================================*/
void IRAM_ATTR inputPinChangeISR(void *args)
{
    // printf(".");
    inputInterruptCounter++;
    int inputIndex = (int)args;
    xQueueSendFromISR(inputInterruptQueue, &inputIndex, NULL);
}

/*==================================================================*/
void IRAM_ATTR loop_Core0_InputPinHandlerTask(void *parameter)
{
    logMessage("loop_Core0_InputPinHandlerTask running...");
    uint8_t inputIndex;

    while (runLoops)
    {
        if (xQueueReceive(inputInterruptQueue, &inputIndex, portMAX_DELAY))
        {
            const inputpin_config_t *pin_config = &board_pin_config.inputConfigs[inputIndex];

            /* Updates the fb.io struct with the GPIO register state from the inputPin_config struct data in Config.h */
            bool registerBitState = (bool)REG_GET_BIT(pin_config->register_address, pin_config->register_bit);
            const uint8_t io_mask = getIONumber(inputIndex);
            
            if ((fb.io & io_mask) != registerBitState)
            {
                (registerBitState) ? fb.io |= io_mask : fb.io &= ~io_mask;
                inputPinInterruptFired[inputIndex]++;

