michaelnu/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
                if (inputPinInterruptFired[inputIndex] >= 50)
                {
                    logMessage("WARNING: Excessive input changes. Index: %d, GPIO: %d. Changed %d times. Resetting counter", inputIndex, pin_config->gpio_number, inputPinInterruptFired[inputIndex]);
                    inputPinInterruptFired[inputIndex] = 0;
                }

                xEventGroupSetBits(xEventStateChangeGroup, (ESPNOW_SEND_BIT)); // Send an async ESP-NOW packet as required

                if (configMode == MODE_CONTROLLER)
                {
                    if (!motorsMoving) 
                    {
                        // Only send a udp feedback pkt if motors are stationary. When moving, feedback sent in realtime as per the fb.io struct
                        xEventGroupSetBits(eventUDPPacketStateGroup, (UDP_SEND_PACKET_BIT));
                    }
                }
            }
        }
    }

    logMessage("Exiting loop_Core0_InputPinHandlerTask");
    vTaskDelete(NULL);
}

/*==================================================================*/
/*================= Setup sections =================================*/
/*==================================================================*/
void setupInputPin(int inputIndex)
{
    /* See Config.h for inputPin board specific configurations */
    const inputpin_config_t *pin_config = &board_pin_config.inputConfigs[inputIndex];

    if (GPIO_IS_VALID_GPIO(pin_config->gpio_number))
    {
        logMessage("INPUT[%d] GPIO: %d, Name: '%s' PullUp: %d, PullDown: %d", inputIndex, pin_config->gpio_number, pin_config->name.c_str(), pin_config->pullup, pin_config->pulldown);
        gpio_reset_pin(pin_config->gpio_number);
        gpio_set_direction(pin_config->gpio_number, GPIO_MODE_INPUT);

        if (pin_config->pullup)
        {
            gpio_pullup_en(pin_config->gpio_number);
        }

        if (pin_config->pulldown)
        {
            gpio_pulldown_en(pin_config->gpio_number);
        }

        /* Use ESP-IDF gpio isr attachment as it permits passing an argument to the ISR function (inputIndex)*/
        gpio_set_intr_type(pin_config->gpio_number, GPIO_INTR_ANYEDGE);
        gpio_isr_handler_add(pin_config->gpio_number, inputPinChangeISR, (void *)inputIndex);
    }
    else
    {
        logMessage("INPUT[%d] Config GPIO unconfigured", inputIndex);
    }
}

/*==================================================================*/
bool startEthernet()
{
    bool ethernet_setup = false;

#if ESP32_RMII_ETHERNET
    const ethernet_phy_pinconfig_t phy_pin_config = eth_phy_configs[configBoardType];
    ethernet_setup = ETH.begin(phy_pin_config.address, phy_pin_config.power_enable_pin, phy_pin_config.phy_mdc_pin, phy_pin_config.phy_mdio_pin, phy_pin_config.phy_type, phy_pin_config.phy_clk_mode, false);

    if (ethernet_setup)
    {
        logMessage("Ethernet driver setup successfully");
    }
    else
    {
        logErrorMessage("Failed to install Ethernet driver. Ensure board type is correct!");
    }
#elif ESP32_SPI_ETHERNET
    ESP32_W5500_onEvent();

    ethernet_setup = ETH.begin(configSpiMisoPin, configSpiMosiPin, configSpiSckPin, configSpiCsPin, configSpiIntPin, SPI_CLOCK_MHZ, ETH_SPI_HOST, (uint8_t *)ethernet_mac);

    if (!ethernet_setup)
    {
        logErrorMessage("SPI Ethernet could not be initialised. Please ensure wiring, board type or 'spiethconf' is correct");
    }
    else
    {
        logMessage("SPI Ethernet driver setup successfully");
    }
#endif

    if (configBoardType != BOARD_TYPE_NONE && ethernet_setup)
    {
        ETH.config(ethernet_ip, ethernet_gw, ethernet_subnetmask);
    }

    return ethernet_setup;
}

/*==================================================================*/
void startSafeModeEthernet()
{
    WiFi.onEvent(WiFiEvent); /* Always map networking event handler irrespective of WiFi enabled/disabled */
    WiFi.mode(WIFI_MODE_AP);
    WiFi.softAP("NULLSSID", "NULLPWD123456", 1, 1, 1);

    logMessage("OTA Setup");
    ArduinoOTA.begin(); /* Enable OTA Service */
    ArduinoOTA.onStart(otaUpdateStart);
    ArduinoOTA.onEnd(otaUpdateEnd);
    ArduinoOTA.onProgress(otaProgress);
    logMessage("OTA Setup Done");

#ifndef ESP32_WOKWI_SIMULATOR
    startEthernet();
#endif

    WiFi.disconnect(true, false);
    WiFi.mode(WIFI_OFF); /* Shutdown WiFi */
}

/*==================================================================*/
void wifiConnectionTask(void *parameter)
{
    /* One-shot background WiFi connection task */
    if (configWifiMode == WIFI_MODE_STA || configWifiMode == WIFI_MODE_APSTA)
    {
        uint8_t connectCount = 0;

        while (WiFi.status() != WL_CONNECTED)
        {
            vTaskDelay(500 / portTICK_PERIOD_MS);
            connectCount++;

            if (connectCount > 10)
            {
                logErrorMessage("Timeout for 5s whilst connecting to WiFi network '%s'. Skipping...", configWifiSSID.c_str());
                break;
            }
        }
    }

    vTaskDelete(NULL);
}

/*==================================================================*/
void setup_Core0(void *parameter)
{
    /* Anything requiring exec on Core0 should be setup in this one-shot task */
    logMessage("setup_Core0()");
    inputInterruptQueue = xQueueCreate(30, sizeof(uint8_t)); // Create queue on Core0 where input ISR execs

#ifndef ESP32_WOKWI_SIMULATOR // Not for simulator. Uses WiFi and Woki Private Gateway to perform UDP port forwarding to LinuxCNC
    logMessage("Starting Ethernet...");

    startEthernet();
    delay(200);
#endif

    logMessage("Starting Telnet server on port 23");
    telnetServer.onClient(onTelnetClient, NULL); /* Uses WIFI & Private gateway on Wokwi simulator*/
    telnetServer.begin();

    if (configMode == MODE_CONTROLLER)
    {
        setupControllerModeCore0();
    }

    delay(10); // Wait for xEventStateChangeGroup to be created;

    xTaskCreatePinnedToCore(
        loop_Core0_InputPinHandlerTask, // Task function.
        "t_C0_InPin",                   // name of task.
        4096,                           // Stack size of task
        NULL,                           // parameter of the task
        4,                              // priority of the task
        NULL,                           // Task handle to keep track of created task
        0);                             // pin task to core 0

