michaelnu/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
    /* Must be performed post Ethernet setup due to SPI interrupt global isr service install */
    logMessage("Configuring inputs...");

    for (uint8_t i = 0; i < MAX_INPUTS; i++)
    {
        setupInputPin(i);
    }

    logMessage("Core0 setup completed successfully");

    startupStage1Complete = true;
    vTaskDelete(NULL);
}

/*==================================================================*/
void stopProcessing()
{
    if (runLoops)
    {
        logMessage("Stop Processing!");
        runLoops = false;

        if (configMode == MODE_CONTROLLER)
        {
            stopProcessingController();
        }
        else if (configMode == MODE_CLIENT)
        {
            stopProcessingClient();
        }

        for (int i = 0; i < MAX_INPUTS; i++)
        {
            const inputpin_config_t *pin_config = &board_pin_config.inputConfigs[i];

            if (pin_config->gpio_number != GPIO_NUM_NC)
            {
                detachInterrupt(pin_config->gpio_number);
            }
        }
        logMessage("Stop Processing Done");
    }
    else
    {
        logMessage("Already stopped");
    }
}

/*==================================================================*/
void otaUpdateStart()
{
    consoleLogging = true; // Enable logging to serial console
    stopProcessing();
    console.~Console();                            // Stop console commands
    delay(150);                                    // Wait for console to stop its task
    printf_P(PSTR("OTA Update Starting....\r\n")); // Use printf to control CRLF
}

/*==================================================================*/
void otaUpdateEnd()
{
    printf_P(PSTR("OTA Update completed\r\n"));
}

/*==================================================================*/
void otaProgress(unsigned int progress, unsigned int total)
{
    printf("OTA Update Progress: %u%%\r", (progress / (total / 100)));
}

/*==================================================================*/
void parseTelnetMessage(AsyncClient *c, String message)
{
    if (message.equals("r\r\n"))
    {
        logMessage("R key pressed. Restart..");
        telnetDisconnectAllClients();
        ESP.restart();
    }
    else if (message.equals("s\r\n"))
    {
        logMessage("S key pressed");
        stopProcessing();
    }
}

/*==================================================================*/
void telnetDisconnectAllClients()
{
    if (telnetClientConnected > 0)
    {
        telnetClient->close();
        telnetClient = NULL;

        if (telnetClientConnected > 0)
        {
            telnetClientConnected--;
        }
    }
}

/*==================================================================*/
void onTelnetClientData(void *s, AsyncClient *c, void *buf, size_t len)
{
    char *str = static_cast<char *>(buf);

    if (len == 5)
    {
        if (memcmp(str, ctrlz_bytes, sizeof(ctrlz_bytes)) == 0)
        {
            telnetDisconnectAllClients();
        }
    }

    String rxMessage(str);
    parseTelnetMessage(c, rxMessage);
}

/*==================================================================*/
void onTelnetClientDisconnected(void *s, AsyncClient *c)
{
    if (telnetClientConnected > 0)
    {
        telnetClientConnected--;
    }

    telnetClient = NULL;
    logMessage("Telnet: client disconnected");
}

/*==================================================================*/
void onTelnetClient(void *s, AsyncClient *c)
{
    telnetClientConnected++;
    telnetClient = c;
    c->onDisconnect(onTelnetClientDisconnected);
    c->onData(onTelnetClientData);
    IPAddress client_address = c->getRemoteAddress();
    logMessage("Telnet: '%s' client connected", client_address.toString().c_str());
    String welcomeMsg = String("Welcome. Version: " + version_number + ". Ctrl+Z to quit\r\n");

    c->write("\eSP F");  // Use 7-bit control codes
    c->write("\e[?25l"); // Hide cursor
    c->write("\e[?12l"); // Disable cursor highlighting
    c->write(welcomeMsg.c_str());
}

/*==================================================================*/
void enterSafeMode(bool basic_commands = false)
{
    safeMode = true;

    console.begin(BAUD_RATE);
    console.registerSystemCommands();
    console.registerNetworkCommands();
    logErrorMessage("BOOT LOOP DETECTED. ENTERING SAFE MODE");

    if (basic_commands)
    {
        logErrorMessage("BASIC COMMANDS DUE TO EXCESSIVE BOOT LOOPS");
        extraSafeModeConsolePrompt();
    }
    else
    {
        safeModeConsolePrompt();
        registerSafeModeConsoleCmds();
        logWarningMessage("MUST use 'getconfig' to setup environment before running 'saveconfig' or 'startethernet'");
        logWarningMessage("Use 'startethernet' safemode command to start Etherner for OTA firmware updates");
    }

    NVS.setInt("BOOT_COUNT", 0); // Clear boot loop counter to retry on next boot
}

/*==================================================================*/
bool safeModeHandler() 
{
    /* Returns true if in safemode. Setup() exits if true */
    uint8_t bootCounter = NVS.getInt("BOOT_COUNT");
    NVS.setInt("BOOT_COUNT", bootCounter + 1);
    logMessage("Boot Count: %d", bootCounter);

    if (bootCounter > 10)
    {
        enterSafeMode(true);
        return true;
    }

    if (bootCounter > 2)
    {
        enterSafeMode();
        return true;
    }

    return false;
}

/*==================================================================*/
void setup()
{
    consoleLogging = true; // Set to show startup setup messages
    esp_log_level_set("*", ESP_LOG_WARN);

    Serial.begin(BAUD_RATE);

    Serial.print("\eSP F");  // tell to use 7-bit control codes
    Serial.print("\e[?25l"); // hide cursor
    Serial.print("\e[?12l"); // disable cursor highlighting
    Serial.println();
    delay(50);
    Serial.println("=================================================");
    Serial.println("==================== STARTUP ====================");
    Serial.println("=================================================");

#ifdef ESP32_WOKWI_SIMULATOR
    logWarningMessage("\n==================== SIMULATOR DEBUG BUILD ====================\n");
#elif ESP32_RMII_ETHERNET
    logMessage("\n============ RMII ETH RELEASE BUILD =============\n");
#elif ESP32_SPI_ETHERNET
    logMessage("\n============ SPI ETH RELEASE BUILD ==============\n");
#endif

