michaelnu/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
    logMessage("Version: %s", version_number);
    logMessage("Setup started..");
    logMessage("APBFreq: %d", getApbFrequency());

    logMessage("Total heap: %d", ESP.getHeapSize());
    logMessage("Free heap: %d", ESP.getFreeHeap());
    logMessage("Total PSRAM: %d", ESP.getPsramSize());
    logMessage("Free PSRAM: %d", ESP.getFreePsram());

#ifndef ESP32_SPI_ETHERNET
    // Only do this once when not SPI ethernet. SPI ethernet driver installs this automatically
    logMessage("Installing Global GPIO ISR Service");
    gpio_install_isr_service(0);
#endif

    NVS.begin(); // init non-volatile flash storage for config store

    if (safeModeHandler())
    {
        return; // Checks for boot loops. Before readNVSConfig in the event of a config related issue
    }

    readNvsConfig(); // Main call to get configuration from NVS

    WiFi.onEvent(WiFiEvent);   /* Always map networking event handler irrespective of WiFi enabled/disabled */
    WiFi.mode(configWifiMode); // from config store

    if (configWifiMode == WIFI_MODE_STA)
    {
        logMessage("WiFi Station: Connecting to WiFi SSID: %s", configWifiSSID);
        WiFi.begin(configWifiSSID, configWifiPwd);
    }
    else if (configWifiMode == WIFI_MODE_AP)
    {
        logMessage("WiFi AP: Creating SSID: %s", configWifiSSID);
        WiFi.softAP(configWifiSSID, configWifiPwd, configWifiHide, 1, 4);
    }
    else if (configWifiMode == WIFI_MODE_APSTA)
    {
        WiFi.begin(configWifiSSID, configWifiPwd);
    }
    else
    {
        logWarningMessage("WiFi is DISABLED in config");
        WiFi.softAP("NULLSSID", "NULLPWD123456", 1, 1, 1);
    }

    logMessage("WiFi MAC: %s", WiFi.macAddress().c_str());

    xTaskCreatePinnedToCore(
        wifiConnectionTask, // Task function.
        "t_C1_WL_Conn",     // name of task.
        4096,               // Stack size of task
        NULL,               // parameter of the task
        tskIDLE_PRIORITY,   // priority of the task
        NULL,               // Task handle to keep track of created task
        1);                 // pin task to core 1

    logMessage("OTA Setup");
    ArduinoOTA.begin(); /* Enable OTA Service */
    ArduinoOTA.onStart(otaUpdateStart);
    ArduinoOTA.onEnd(otaUpdateEnd);
    ArduinoOTA.onProgress(otaProgress);
    logMessage("OTA Setup Done");

    if (configWifiMode == WIFI_OFF)
    {
        WiFi.disconnect(true, false);
        WiFi.mode(WIFI_OFF); /* shutdown wifi */
    }

    if (hasI2SOutputs)
    {
        i2s_out_init();
    }

    runLoops = true; // Important to ensure background tasks exec in a loop

    xTaskCreatePinnedToCore(
        setup_Core0,      // Task function.
        "t_C0_Setup",     // name of task.
        4096,             // Stack size of task
        NULL,             // parameter of the task
        tskIDLE_PRIORITY, // priority of the task
        NULL,             // Task handle to keep track of created task
        0);               // pin task to core 0

    if (configMode == MODE_CONTROLLER)
    {
        setupControllerMode();
    }
    else if (configMode == MODE_CLIENT)
    {
        setupClientMode();
    }

    logMessage("Setup completed successfully");

    while (!startupStage1Complete)
    { 
        // Wait for all required tasks to finish starting before enabling console
        delay(200);
    }

    consoleLogging = false; // Disable logging to console once startup is complete

    defaultConsolePrompt();
    console.begin(BAUD_RATE);
    console.registerSystemCommands();
    console.registerNetworkCommands();
    console.registerGPIOCommands();

    registerConsoleCmds(); // In ConsoleMenus.cpp

    if (configBoardType == BOARD_TYPE_NONE)
    {
        logErrorMessage("No board type configured. See 'boardconfig' in 'help'");
    }

    if (configMode == MODE_CONTROLLER && !doMotorConfig)
    {
        logWarningMessage("Controller mode selected but motor configuration is not enabled. See 'setmotor','enablemotorconfig' commands in 'help'\r\n");
    }

    if (configMode == MODE_CONTROLLER && configVersion == 0)
    {
        logWarningMessage("Controller mode is default. To use Client mode see 'mode'\r\n");
    }

    if (configMode == MODE_CLIENT && configRemotePeerAddress.equals(""))
    {
        logWarningMessage("Client mode selected but Controller MAC address unset. See 'setcontrollermac' in 'help'\r\n");
    }

    if (configEspNowEnabled && configWifiMode != WIFI_MODE_APSTA)
    {
        logWarningMessage("ESP-NOW is enabled but WiFi mode not set to AP+STA. See 'wificonfig' mode 3 in 'help'\r\n");
    }

    NVS.setInt("BOOT_COUNT", 0); // Reset boot loop detection
}

/*==================================================================*/
void loop()
{
#ifndef ESP32_WOKWI_SIMULATOR // Not for Wokwi Simulator
    if (eth_connected || wifi_connected)
    {
        ArduinoOTA.handle(); // Handles a code update request
    }
#endif

    delay(200);
}
